import { Faculty } from './types.js';
/**
 * Список факультетів університету.
 * @category Schedule
 *
 * @remarks
 * - `none`: { id: 0, name: 'Оберіть факультет' }
 * - `physicsMath`: { id: 1001, name: 'Фізико-математичний факультет' }
 * - `philologyJournalism`: { id: 1002, name: 'Навчально-науковий інститут філології та журналістики' }
 * - `historyLawPublic`: { id: 1003, name: 'Факультет історії, права та публічного управління' }
 * - `foreignPhilology`: { id: 1004, name: 'Навчально-науковий інститут іноземної філології' }
 * - `natural`: { id: 1005, name: 'Природничий факультет' }
 * - `pedagogy`: { id: 1006, name: 'Навчально-науковий інститут педагогіки' }
 * - `socialPsychology`: { id: 1007, name: 'Соціально-психологічний факультет' }
 * - `physicalEducation`: { id: 1008, name: 'Факультет фізичного виховання і спорту' }
 * - `preUniversityCenter`: { id: 1009, name: 'Центр доуніверситетської освіти та освіти дорослих' }
 * - `partTime`: { id: 1010, name: 'Заочна форма навчання' }
 * - `postgraduate`: { id: 1011, name: 'Відділ аспірантури та докторантури' }
 * - `scientificLyceum`: { id: 1012, name: 'Науковий ліцей' }
 */
export declare const faculties: Record<string, Faculty>;
/**
 * Список помилок для розкладу.
 * @category Schedule
 *
 * @remarks
 * Ключі — числові коди помилок.
 * Значення — опис помилки.
 *
 * Коди помилок:
 * - -200: Не має доступу до сервера або помилка доступу до бази даних
 * - -100: Помилка у роботі модуля, зверніться до розробника
 * - -90: Об`єкт, для якого потрібно показати розклад, не знайдено
 * - -80: Неправильний режим (помилка у параметрі req_mode або req_type)
 * - -70: Помилка у датах
 * - -60: Помилка у параметрах
 * - -7: Зараз відбувається технічне обслуговування бази, робота тимчасово неможлива!
 * - -6: Вигрузка всього розкладу разом заборонена Адмiнiстратором
 * - -5: Технічні роботи на сервері
 * - -4: За даним запитом нічого не знайдено
 * - -3: Перегляд розкладу на вказані дати заблоковано адміністратором (Розклад у процесі складання і ще не готовий для демонстрації)
 * - -2: Перегляд розкладу заблоковано адміністратором (Розклад у процесі складання і ще не готовий для демонстрації)
 * - -1: Розклад у базі відсутній
 */
export declare const scheduleErrors: Record<number, string>;
/**
 * Тип розкладу.
 * @category Schedule
 *
 * @remarks
 * Типи: group, teacher, room.
 */
export declare const scheduleTypes: Record<string, string>;
/**
 * Блоки
 * @category Audience
 */
export declare const blocks: Record<string, string>;
